[{"published": "Wed, 17 Sep 2025 20:24:54 EDT", "url": "https://www.cbc.ca/news/canada/boycott-disney-jimmy-kimmel-1.7638114?cmp=rss", "headline": "Canadian actor Tatiana Maslany joins calls to boycott Disney amid Jimmy Kimmel fallout", "author": {"name": "Natalie Stechyson", "url": "https://cbc.ca/news/author/natalie-stechyson-1.6403351"}, "story": "Several Hollywood names have joined the growing movement to boycott Disney after ABC pulled Jimmy Kimmel off the air.Tatiana Maslany, the Canadian actress who starred in the Disney+ series She-Hulk: Attorney at Law, posted a call to action in her Instagram stories Thursday.\"Cancel your @disneyplus @hulu @espn subscriptions!\" she wrote in the post, which featured a throw-back photo from the Marvel set.ABC, the broadcaster owned by Walt Disney, said on Wednesday it was yanking Jimmy Kimmel Live! indefinitely after the nation's top communications regulator threatened to investigate Kimmel's commentary about the assassination of far-right activist Charlie Kirk, a prominent ally of U.S. President Donald Trump.The decision comes as Trump has repeatedly pressured broadcasters to stop airing content he has found objectionable and called on the Federal Communications Commission to pull licences from stations. FCC chair Brendan Carr drew immediate criticism for pressuring Disney and local broadcasters to drop Kimmel's show.Amid the backlash and debates about free speech and censorship, people are also calling for a boycott of Disney and Hulu streaming services.Other prominent figures who have posted about boycotting the companies behind the decision include writer and producer Damon Lindelof, best known for Watchmen and Lost, who wrote on Instagram that he \"can't in good conscience work for the company\" if Kimmel's suspension isn't lifted soon.Transparent actor Amy Landecker posted a photo of her Disney+ subscription cancellation. Frances Fisher (Titanic, Unforgiven, Jolene) posted a guide in her Instagram stories on how to boycott Disney and ABC.Boycott threads have also gained traction on social media platforms like Reddit and X, where people are posting not just about cancelling their streaming subscriptions, but also Disney vacations and cruises.\"Our annual trip to Disney Orlando won't happen. Disney Channel was cancelled yesterday. I'm only one. There are millions more like me,\" wrote prominent social media personality Travis Matthew on X.\"Not going to be spending my money on Disney stuff for the foreseeable future. The park price hikes were hard enough, but the company bending the knee and not standing firm on the 1st Amendment makes it a whole lot easier for me to not supply them with any of my money,\" commented a user on the Disneyland subreddit.The comments came during Kimmel's opening monologue Monday.\"We hit some new lows over the weekend, with the MAGA gang desperately trying to characterize this kid who murdered Charlie Kirk as anything other than one of them, and with everything they can, to score political points from it,\" Kimmel said.Kirk, a close conservative ally of Trump, was killed by a sniper's bullet on Sept. 10 at a university campus in Utah. On Sept. 12, authorities announced they had the accused killer, 22-year-old Tyler Robinson, in custody.There's been a lot of speculation about a potential motive, with politicians and partisans attempting to blame the other side. Trump blamed \"the radical left,\" while others theorized some of the messages found on the bullet casings could link the suspect to the far right.Trump’s pressure on U.S. media: Where does it end?On Tuesday, prosecutors outlined more evidence against Robinson, including statements from his parents that described him as moving left politically and \"becoming more pro-gay and trans-rights oriented.\"Speaking to CNBC on Thursday, Carr said the issue is that Kimmel appeared to \"mislead\" the public. Executives will meet with Kimmel to discuss the future of his program, Bloomberg News reported on Thursday, citing three people with knowledge of the matter.", "relatedStories": [{"url": "https://cbc.ca/news/world/jimmy-kimmel-charlie-kirk-1.7636974", "text": " Did Jimmy Kimmel 'mislead' people with Charlie Kirk comments, and does it matter?"}, {"url": "https://cbc.ca/news/entertainment/late-night-tv-shows-jimmy-kimmel-1.7638000", "text": " What late-night TV hosts said about Jimmy Kimmel's suspension"}]}, {"published": "Fri, 19 Sep 2025 20:15:10 EDT", "url": "https://www.cbc.ca/news/world/trump-u-s-military-struck-alleged-drug-smuggling-boat-1.7639196?cmp=rss", "headline": "Trump says U.S. has launched 3rd fatal strike in a month on alleged drug smuggling boat", "author": null, "story": "U.S. President Donald Trump said Friday the military carried out its third fatal strike against an alleged drug smuggling vessel this month.Trump in a social media posting said the strike killed three and was carried out against a vessel \"affiliated with a Designated Terrorist Organization conducting narcotrafficking in the USSOUTHCOM area of responsibility.\"He did not provide more precise details about the location of the strike, and the White House and Pentagon did not immediately respond to requests for comment from The Associated Press.\"Intelligence confirmed the vessel was trafficking illicit narcotics, and was transiting along a known narcotrafficking passage enroute to poison Americans,\" Trump said in the post.Trump on Monday announced the U.S. military had carried out a strike on a boat allegedly carrying drugs from Venezuela. That strike also killed three on board.That followed a Sept. 2 military strike on what the Trump administration said was a drug-carrying speedboat that killed 11. Trump said the boat was operated by the Tren de Aragua gang, which was listed by the U.S. as foreign terrorist organization earlier this year.The U.S. government has justified the military action as a necessary escalation to stem the flow of drugs into the country.But several senators — Democrats and some Republicans — as well as human rights groups have questioned the legality of the actions. They view them as a potential overreach of executive authority in part because the military was used for law enforcement purposes.", "relatedStories": [{"url": "https://cbc.ca/news/world/us-venezuela-strike-1.7625915", "text": " U.S. secretary of state asked if drug boats from allied countries could ever face 'unilateral execution'"}, {"url": "https://cbc.ca/news/world/venezuela-us-attack-military-drug-cartels-1.7624235", "text": " Here are the facts on the U.S. military operation against Venezuela"}]}, {"published": "Fri, 19 Sep 2025 04:01:00 EDT", "url": "https://www.cbc.ca/news/politics/canada-big-step-back-from-us-data-1.7637651?cmp=rss", "headline": "Canadians are taking a big step back from the U.S. — and here's the data to prove it", "author": {"name": "John Paul Tasker", "url": "https://cbc.ca/news/politics/author/john-paul-tasker-1.3389288"}, "story": "In the weeks after U.S. President Donald Trump sparked a trade war with his punishing tariffs, Prime Minister Mark Carney said Canada's \"old relationship\" with the U.S. would be \"over\" soon — and now there's some hard evidence that is indeed happening.CBC News reviewed datasets on travel, trade, shopping and culture, and all of them paint a similar picture: Canadians are taking a big step back from the U.S.Months after Trump launched his trade broadside and prompted a national backlash with his 51st state taunts, the Canadian travel boycott is still in full swing with many shunning cross-border travel, prompting airlines to cancel U.S. flights and curb capacity.Canadian exports to the U.S. have dropped off while those to non-U.S. foreign countries have surged — a pattern that could accelerate further as the government races to cut new trade deals and help businesses capitalize on the ones that have already been signed.The grassroots \"Buy Canadian\" campaign has fundamentally reshaped parts of the retail landscape with grocers scrapping some U.S. products entirely while adding dozens of domestic suppliers to fill the void. There are even signs Canadian cultural consumption patterns have shifted in the wake of Trump's economic assault with viewership and sales up for homegrown content. Canadian-authored books in particular are getting a big lift.Polls suggest support for some Canadian institutions is also on the rise as more people shun U.S.-style republicanism and back the monarchy, especially after King Charles's high-profile visit.Carney has described Trump's actions as a \"rupture\" to the global order that demands a new way of thinking. Canadians themselves are leading the way.And the Americans are noticing.\"All of these types of things, I'm sorry, that doesn't tell me that Canada is passionate about this relationship in the same way that we are,\" Trump's ambassador to Canada, Pete Hoekstra, said this week.There is one area in particular where that Canada-U.S. \"rupture\" has been most evident: travel.The latest numbers suggest it's not just a slump. Canadian visits to the U.S. are in free fall, months after some commentators said the boycott might be a blip.According to Statistics Canada data, the number of Canadian residents coming back from the U.S. by car in August dropped a stunning 34 per cent compared to the same month last year.That's the eighth consecutive month of year-over-year declines — an unprecedented phenomenon outside of the COVID-19 health crisis.And it's not just day-trippers going by car who are turning on U.S. travel, as it was in the early days of this boycott. The number of Canadians returning by air from the U.S. fell 25.4 per cent in August.U.S. data also reveals a huge disruption. About 1.3 million fewer people crossed into the country from its northern border in July compared to that month in 2024, according to a review of U.S. Customs and Border Protection figures.Air Canada, Flair, Porter and WestJet have cut some U.S. routes altogether and dialled back on how often they serve certain cities.A spokesperson for Air Canada told CBC News eight Canada-U.S. routes have been suspended so far this year and the flag carrier is deploying smaller planes to serve a number of American destinations — including to popular spots like Las Vegas.But there's still strong demand for non-U.S. foreign travel: Air Canada has added 28 international routes so far this year as Canadian vacationers pivot to Europe, the Caribbean and South America.As the U.S. Travel Association noted in a research report on Canada before the trade war erupted, Canadian tourists have an \"enormously positive impact on the U.S. trade balance with Canada\" and, in 2024, spent some $20.5 billion US while they were there.A spokesperson for the association said in a statement that just a 10 per cent decline in Canadian tourists could wipe out some 14,000 U.S. jobs — the drop is on pace to be much larger than that in 2025.On Friday, Hoekstra suggested the low travel numbers were due to sentiment from Canadian politicians.\"I'm not surprised that there are Canadians who are not travelling to America when you have political leaders running national campaigns that are anti-American,\" he said at an event hosted by the Fredericton Chamber of Commerce.Trump's decision to impose tariffs on virtually all Canadian goods — with exemptions for those that are compliant with the Canada-U.S.-Mexico Agreement (CUSMA) — has reordered the country's export patterns.According to a CBC News analysis of Statistics Canada data, Canadian exports to the U.S. have dropped by about two per cent this year, a figure driven in part by tariffs that have made those goods more expensive for American importers. That seemingly small decline is costly and works out to a $5-billion hit to exports.As hope for a quick resolution to the U.S. trade dispute fades, Canadian companies have wasted no time in finding new markets or tapping old relationships that have atrophied in the years since Canada went all-in on the States.This year, the United Kingdom has emerged as Canada's second-largest export market — not including the European Union as a whole — displacing China.Canadian exports to Great Britain and Northern Ireland have spiked by 63 per cent in the months since Trump was inaugurated, according to federal export data. Canada is sending more advanced technologies, energy, critical minerals, infrastructure, transportation and agri-food products to its Commonwealth cousin than in the past.Overall, exports to Europe are up 26 per cent this year — and the joint Canada-Germany agreement signed last month by Carney and his German counterpart could draw this country even closer to the Old World.Canadian businesses are also turning to other Western Hemisphere countries to bolster trade ties. While trade with Mexico is off slightly amid CUSMA uncertainty, Canadian exports to Central and South America are up some 13 per cent this year.The Buy Canadian movement has prompted big changes in retail, too.A spokesperson for Indigo, the country's largest bookseller, said sales of Canadian-authored books are up 25 per cent year-over-year.\"Our uptick is especially strong in stores where we started stickering all books written by Canadian authors in February and the corresponding lift in sales was immediate,\" the spokesperson said.U.S. alcohol sales are virtually non-existent in large swaths of the country as most premiers hold firm on keeping those products off store shelves.Brown-Forman, the parent company of major U.S. alcohol brands like Jack Daniel's whisky and Woodford Reserve bourbon, reported in its recent quarterly earnings that sales to Canada have dropped by an eye-popping 62 per cent.As for food, Canada's counter-tariffs — which Carney just lifted to help secure a deal with Trump — pushed up the price of some U.S. goods.According to Loblaw Companies CEO Per Bank, sales volumes of these tariffed American products are down 15 to 20 per cent on average this year — with some categories reporting an even steeper 50 per cent decline.Sales of domestic products, meanwhile, are still up, Bank said in a social media post, \"demonstrating the strong desire by consumers to continue supporting Canadian products and brands.\"A spokesperson said the supermarket giant has added more than 100 new Canadian suppliers of various food and other items since the start of the year as consumers turn on American goods out of patriotism or because of higher prices.Canadians are generally voracious consumers of American culture — but some data points suggest people here are showing more interest in productions closer to home now that Canada-U.S. relations have hit a rough patch.According to CBC/Radio-Canada, there has been a 34 per cent increase this year in time spent watching content on Gem, the public broadcaster's streaming platform.A spokesperson for the company said there's been notable spike in viewership for homegrown programs like Wild Cards (up 200 per cent), Heartland (78 per cent), Schitt's Creek (53 per cent) and Murdoch Mysteries (44 per cent) so far this year compared to the same period in 2024.Viewership for the Juno Awards, which celebrates Canadian music, surged 400 per cent on streaming platforms and drew strong conventional TV ratings with more than 2.8 million tuning in to some or all of the show, which leaned into the Canada-U.S. dispute.New data shows how much Canadians are avoiding the U.S.Historica, the education charity that promotes Canadian history through programs like its Heritage Minutes, told CBC News it is tracking greater interest in the country's past.Anthony Wilson-Smith, Historica's president and CEO, said the charity has \"noticed a sharp uptick in the amount of time users are spending\" on the Canadian Encyclopedia, which is on pace to draw more than 14 million pageviews this year.Christopher Sands, director of the Johns Hopkins Center for Canadian Studies in Washington, said it's not a surprise Canadian antipathy toward the U.S. has not gotten any better — the 51st state talk is gone but the tariffs are still wreaking havoc.Carney made a series of goodwill gestures — ramping up defence and border spending, dropping the digital services tax and lifting the retaliatory tariffs — and still got nothing out of Trump on trade, Sands said.\"I can't expect Canadians to change their minds if they aren't getting anything in return — not even a gesture. Trump hasn't done anything to suggest that he gets he's gone too far with Canada,\" Sands said in an interview.\"We need a turnaround from Trump that's visible and public and gives Canadians a reason to stop being so angry. So far, there hasn't been anything to signal, 'OK, go back to normal, red alert over.' But I hope we can break the fever because it's gone on way too long.'\"", "relatedStories": []}, {"published": "Fri, 19 Sep 2025 14:34:24 EDT", "url": "https://www.cbc.ca/news/canada/british-columbia/david-teboul-regional-rcmp-commander-assault-choking-charges-abbotsford-1.7638595?cmp=rss", "headline": "RCMP regional commander charged with assault, choking while off duty in B.C.", "author": {"name": "Chad Pawson", "url": "https://cbc.ca/news/author/chad-pawson-1.3477362"}, "story": "RCMP Assistant Commissioner David Teboul has been charged with three counts of assault, according to the B.C Prosecution Service (BCPS).The service says the alleged offences occurred on July 2 while Teboul, the federal policing regional commander for the Pacific Region, was off duty in Abbotsford, B.C.BCPS says Teboul is facing one count of assault and one count of assault by choking in relation to one complainant, and a third count of assault in relation to a second complainant. Teboul has been a Mountie since 1997 and in his current role since 2024, according to the RCMP website.High-ranking Mountie charged with assault in off-duty incident in B.C.He has been the public face on numerous major cases in B.C. in recent years, delivering updates on illicit narcotic investigations and the investigation into the killing of Sikh-Canadian activist Hardeep Singh Nijjar in Surrey.Abbotsford police said officers were called to a reported assault at a public facility in the 2400 block of McMillan Road, according a news release.Police did not specify which facility they were called to. The Abbotsford Recreation Centre and McMillan Park — including the McMillan Oval, soccer field, baseball diamond and skate park — are located in the block.Abbotsford Police Department declined to comment further, and noted a publication ban has been ordered in the case.Dawn Roberts, the director in charge of B.C. RCMP communications, said in an email to CBC News that once the force learned about the charges, they launched a code of conduct investigation, which remains ongoing.\"A/Commr. Teboul has been temporarily re-assigned and his duty status is subject to continuous review and assessment,\" said Roberts.The BCPS says they have chosen Andi MacKay, a senior Vancouver lawyer in private practice, as a special prosecutor for the case.The service said this was done \"to avoid any potential for real or perceived improper influence in the administration of justice considering the nature of the allegations and the identity of the accused as a police officer in a senior position of authority.\"Teboul's first appearance is scheduled for Oct. 9 at Abbotsford Law Courts.", "relatedStories": [{"url": "https://cbc.cahttps://www.cbc.ca/news/canada/british-columbia", "text": " Top stories from British Columbia"}, {"url": "https://cbc.ca/news/canada/british-columbia/blair-donnelly-trial-closing-arguments-light-up-chinatown-festivals-2023-stabbings-1.7638193", "text": " B.C. man who claims he stabbed 3 on 'God's will' isn't responsible, lawyer argues"}, {"url": "https://cbc.ca/news/canada/british-columbia/chinese-shipyard-b-c-ferries-vessels-chrystia-freeland-1.7638242", "text": " Freeland called back to testify on B.C. Ferries' deal with Chinese shipyard"}, {"url": "https://cbc.ca/news/canada/british-columbia/surrey-school-board-surplus-2025-1.7637996", "text": " Surrey School Board sees $33M surplus, earmarked for new computer systems, rainy day fund"}]}, {"published": "Fri, 19 Sep 2025 15:52:41 EDT", "url": "https://www.cbc.ca/sports/rugby/women-rugby-world-cup-canada-new-zealand-semifinal-1.7638672?cmp=rss", "headline": "Canada dazzles to end New Zealand's Women's Rugby World Cup dominance and reach final", "author": {"name": "Foster Niumata", "url": "https://cbc.ca/sports/author/foster-niumata-1.5291114"}, "story": "The Women's Rugby World Cup will have a new queen.New Zealand's eight-year reign as world champion was terminated by Canada in a stunning 34-19 semifinal victory in Bristol, England, on Friday.Canada flew to a shocking 24-7 lead by halftime, added a fifth try by captain Alex Tessier straight after the break then held on to reach only its second World Cup final.\"I said to the girls to stop crying because we have a job to do in eight days,\" Canada coach Kevin Rouet said. \"That's the mindset. We need to finish the job. I am excited for next weekend. I want it to be next weekend now.\"Canada lost its only other final in 2014 to England.England plays France in the other semifinal on Saturday in Bristol.Canada's victory was not a surprise. It won and drew its last two matchups with New Zealand after 17 straight defeats. What did surprise was how much Canada dominated the Black Ferns.The forwards, especially totemic lock Sophie de Goede, stymied New Zealand up front and the backs, led by scrum half Justine Pelletier, outsmarted their opposites.WATCH | Canada stuns New Zealand with dominant performance: Sophie de Goede leads Canada to the Women's Rugby World Cup finalTheir first World Cup win over six-time champion New Zealand was also only the third time the Black Ferns have lost in tournament history. The Black Ferns suffered their first World Cup loss in 11 years and their first loss in a knockout match in 34 years.\"Canada were impressive,\" New Zealand coach Allan Bunting said. \"Canada were accurate and we weren't, and that's the difference.\"Two errors by New Zealand fullback Renee Holmes and two pieces of skill by fly half Taylor Perry led to Canada's 12-0 dream start in as many minutes.Holmes' kick out on the full led to Perry's chaos-causing chip and Pelletier's converted try, then Perry's over-the-top pass found left wing Asia Hogan-Rochester, who palmed off Holmes to score.Canada's forwards took charge and 14 phases narrowed the Black Ferns defence for Tessier who, just before she was cut in half, sent in midfield partner Florence Symonds and extended their lead to 17-0.New Zealand hit back after Stacey Waaka caught the restart. Prop Tanya Kalounivale barged over but New Zealand's rushed errors kept giving back Canada turf and ball.And five minutes from the break, de Goede's intuitive connection with Pelletier paid off again when she took a round-the-corner off-load and streaked in between the posts. The lock converted her own try — she was four of six off the tee — and Canada was flying.New Zealand came in with a tournament-leading 93 per cent successful tackle rate but missed 18 tackles in the first half.Right from the restart, prop DaLeaka Menin stripped New Zealand of the ball and Tessier ended up stepping off her right foot and crossing untouched for another converted try.New Zealand rallied with scores by flanker Liana Mikaele-Tu'u and teenage wing Braxton Sorensen-McGee — her ninth try in her maiden World Cup — but the pressure to catch up played into Canada's hands.Canada's defence was happy to concede penalties to corral New Zealand.De Goede added a final penalty kick to wrap up one of Canada's greatest victories.\"Huge relief and excitement and pride after that,\" De Goede said. \"We knew it was going to take an incredible performance to beat them and I am just really proud we were able to put that out on the field and keep control in that game.\"", "relatedStories": [{"url": "https://cbc.ca/sports/rugby/canada-australia-women-world-cup-rugby-quarterfiinal-1.7632627", "text": " Canada dominates Australia to reach Women's Rugby World Cup semis, will face New Zealand"}, {"url": "https://cbc.ca/sports/rugby/canada-wales-womens-rugby-world-cup-recap-august-30-1.7622002", "text": " Canada crushes Wales 42-0, advances to quarterfinals at Women's Rugby World Cup"}, {"url": "https://cbc.ca/sports/rugby/canada-womens-rugby-world-cup-cp-aug-23-1.7616335", "text": " Julia Schell scores 6 tries to power Canada to win at Women's Rugby World Cup"}, {"url": "https://cbc.ca/sports/rugby/canada-womens-rugby-world-cup-cp-1.7615651", "text": " Canadian women open play at Rugby World Cup with high hopes of going all the way"}]}, {"published": "Wed, 18 Jun 2025 05:01:00 EDT", "url": "https://www.cbc.ca/news/canada/nova-scotia/rcmp-say-cadaver-dogs-will-be-deployed-to-search-for-missing-n-s-children-1.7638195?cmp=rss", "headline": "RCMP say cadaver dogs will be deployed to search for missing N.S. children", "author": {"name": "Aly Thomson", "url": "https://cbc.ca/news/canada/nova-scotia/author/aly-thomson-1.5129882"}, "story": "Cadaver dogs will soon scour for two children who disappeared from rural Nova Scotia more than four months ago, but RCMP maintain they do not have reason to believe Lilly and Jack Sullivan are dead.Lilly, 6, and Jack, 4, were reported missing on May 2, when police received a 911 call from their mother saying they had wandered away from their home in Lansdowne Station, a sparsely populated community in Pictou County about 140 kilometres northeast of Halifax.Their disappearance sparked an extensive grid search that spanned 8.5 square kilometres of mostly dense woods and involved about 160 ground search and rescue volunteers, service dogs, drones and helicopters.But cadaver dogs, trained to pick up the scent of human remains, were not deployed during that search.On Friday, police said there are \"searches planned,\" but would not say where and when, citing safety concerns. They did confirm the searches will not happen this weekend. During a media availability Friday, Cpl. Guillaume Tremblay said police have taken a number of investigative avenues, including the ground searches, following up on more than 800 tips and reviewing more than 8,000 videos.Deploying cadaver dogs is a next step in the investigation, he said.\"What's important to remember is that at this time, we don't have any definitive information to support that the children are deceased. But we have to keep our minds open and look at all investigative avenues,\" said Tremblay.\"This is another example of utilizing all services that are available to our officers and we have to remain patient. I know the public, our officers, want to know what happened and we're not going to stop until we find out what happened.\"The children's paternal grandmother, Belynda Gray, said she wanted to \"jump up and down\" upon hearing the news Friday. Gray has long called for cadaver dogs to be brought in.Nevertheless, she feels the investigation is not progressing quickly enough and she's troubled by the lack of information being provided by police.\"They're finally doing something that to me should have been done a couple of months ago at least,\" said Gray, whose son Cody Sullivan is Jack and Lilly's biological father, although he has not been in their lives for three years.\"It's really been a roller-coaster. You get through your days and you just do the best you can.\"Tremblay said police dogs that were deployed during previous searches are trained to pick up the scent of a living person or someone who had recently died.Staff Sgt. Stephen Pike, program manager of the RCMP Police Dog Services Training Centre in Innisfail, Alta., said human remains detection dogs are highly specialized and highly trained to detect the distinct odour of decomposition.None of the roughly six to eight dogs that are in service in Canada are based in Nova Scotia, he said. There is one dog team on P.E.I., but they are not currently operational due to a medical leave.Sgt. Dave Whalen and his dog Kitt will join Insp. Luke Rettie and his dog Narc to conduct the searches over the coming days and weeks, RCMP said. Both are based in British Columbia.Speaking generally, Pike said cadaver dogs are usually brought in when there is reason to believe decomposition has taken place and other possibilities — such as the person wandered off — have been ruled out.He said the success of the dogs depends completely on whether the odour is present and being released. If the remains are somewhere airtight, the odour may not be detectable.There is no definitive timeline on how long the scent can remain detectable, as it depends on the size of the person and environmental factors, said Pike. But he noted a case in which a dog uncovered material related to an investigation two years later from the ocean floor at low tide.They're also able to detect scents underwater and underground. Even in challenging environments like septic fields or landfills, the dogs can be effective because human decomposition is unique.\"They don't rely on the visual. They will take us to that foliage. They will take us to those somewhat concealed or buried or whatnot [areas]. If there's odour present, the dogs will locate it,\" said Pike, who has been a dog handler for 25 years.Court documents shed new light on case of missing N.S. childrenIn late August, CBC asked the RCMP if cadaver dogs would be deployed. A spokesperson said any searches for human remains \"will be based on information gathered through the ongoing investigation.\"\"Officers are continuing to assess information and forensic evidence, including that collected from the large search area,\" Cindy Bayers said in an email statement on Aug. 25.Those items included a pink blanket that was seized on Lansdowne Road early in the search.Court documents released in late August revealed that as of July 16, investigators did not believe the case was criminal in nature.", "relatedStories": [{"url": "https://cbc.ca/news/canada/nova-scotia/extensive-rcmp-scrutiny-of-missing-children-s-mother-stepfather-suggests-no-criminal-involvement-1.7615551", "text": " RCMP scrutiny of missing N.S. children's mother, stepfather suggests no criminal involvement"}, {"url": "https://cbc.ca/news/canada/nova-scotia/n-s-rcmp-investigate-copper-theft-1.7626317", "text": " N.S. RCMP investigate copper theft from construction site"}, {"url": "https://cbc.ca/news/canada/newfoundland-labrador/coast-guard-protest-stjohns-1.7636043", "text": " 4 years after 2 men were lost at sea, family and friends demand more search and rescue resources in Labrador"}, {"url": "https://cbc.ca/news/canada/nova-scotia/animals-displaced-annapolis-county-wildfire-1.7618971", "text": " Nova Scotians open their doors to animals displaced by Annapolis County wildfire"}, {"url": "https://cbc.ca/news/canada/nova-scotia/n-s-liberals-to-table-bill-that-would-ban-use-of-social-media-by-children-under-16-1.7619083", "text": " N.S. Liberals to table bill that would ban use of social media by children under 16"}]}, {"published": "Fri, 19 Sep 2025 18:44:29 EDT", "url": "https://www.cbc.ca/news/canada/edmonton/notwithstanding-clause-alberta-1.7638997?cmp=rss", "headline": "Notwithstanding clause won't stop court challenges of Alberta trans laws, groups say", "author": {"name": "Lisa  Johnson", "url": "https://cbc.ca/news/author/lisa-johnson-1.7321226"}, "story": "Doctors and 2SLGBTQ+ advocacy groups challenging Alberta laws affecting transgender people say they aren't backing down, after learning the province is looking at plans to invoke the Charter's notwithstanding clause.The clause allows governments to override certain sections of the Charter of Rights and Freedoms for up to five years.A leaked internal memo from Premier Danielle Smith's office, obtained by The Canadian Press, directs officials to apply the clause this fall to three laws that police school pronouns, female sports and gender-affirming health care.Two of those laws are being challenged by 2SLGBTQ+ advocacy groups Egale and Skipping Stone. In one lawsuit challenging the government's ban on puberty blockers and hormone treatment for those under 16, the groups are joined by five affected youth and their families.Helen Kennedy, executive director of Egale, said the fallout from the laws would be tragic for those young people, who are frightened and unsure of the future.\"Knowing now what the implications are of your own government targeting you and your ability to access basic services, like health care, and targeting and attacking your identity — it's really shocking,\" she said.\"How do you counter Goliath?\"She said Egale needs to regroup with affected families to decide how to approach the next phase of litigation.\"I assure you, we will be back in court on this,\" Kennedy said.Eldyka Simpson, a mother of a teenage athlete who is non-binary, is concerned about the kind of message the government is sending to students who are part of the 2SLGBTQ+ community with this clause.Fifteen-year-old Riley Simpson plays for the boys' volleyball team at their school, but won't be able to play on the girls' softball team under the new rules.\"I can't imagine being a child or a youth or a teenager who wakes up hearing that their government, that their leaders are prepared to say that your rights are not protected as much as the other kid next to you in this school,\" Eldyka said.\"My child didn't set out to win championship medals and go on a team that didn't match their sex at birth. [The government] is creating harm for kids. The ... [Fairness and Safety in Sport] Act is anything but safe.\"Jeff Park, executive director of the Alberta Parents' Union, said there is nothing unseemly about the government considering the use of the notwithstanding clause, especially as he believes the legislation protects parents' rights.\"We would see that as appropriate, a use of the notwithstanding clause to make sure that this wildly popular and necessary law protecting the rights of parents stays in effect in Alberta,\" he said. \"So for us, that signals that this government has heard from parents, has heard our concerns and is eager to vindicate our authority in education over our own children.\"The health restriction law is currently subject to a court-ordered injunction.The document directs officials to craft background information on legal implications and other options to be considered.It says the plan is to brief Smith ahead of time, then bring the proposal to cabinet Oct. 21. The house resumes sitting with a throne speech two days later.The house resumes sitting with a throne speech two days later.Justice spokesperson Heather Jenkins, asked Thursday for comment on the memo, responded in a one-sentence statement.\"Alberta's government will continue to vigorously protect the safety and well-being of children using all available legal and constitutional means at our disposal, including the notwithstanding clause should our government deem it necessary,\" Jenkins wrote.Smith did not speak with reporters at an event Friday in downtown Calgary.When asked to comment on her government looking at plans to invoke the notwithstanding clause, Smith said to bring questions at her next media availability.In June, the premier said she was confident the government had a solid case.\"We want to battle this out and the way you do that is you go to the higher levels of court. If we were to impose the notwithstanding clause, everything would stop,\" she said at the time.The Canadian Medical Association and three Alberta-based doctors are also challenging the health law's constitutionality in a separate case launched in May, arguing the law violates the Charter right to freedom of conscience.The association said Friday there has so far been no legal response from the government and nothing has changed with respect to its legal challenge.The group's president, Dr. Margot Burnell, urged the province to back off on using the notwithstanding clause to enact legislation that directly interferes in the clinical care of patients.\"It represents an unprecedented government intrusion into the physician-patient relationship that requires doctors to disregard clinical guidelines, the needs of patients and their own conscience,\" Burnell said in a statement.\"This kind of political interference is unacceptable and risks setting a precedent that affects other national health issues, such as vaccination, reproductive health, medical assistance in dying, or even cancer or surgical care.\"", "relatedStories": [{"url": "https://cbc.ca/news/canada/edmonton/alberta-transgender-legislation-1.7637890", "text": " Alberta looks to use notwithstanding clause on its 3 transgender laws: memo"}, {"url": "https://cbc.ca/news/canada/calgary/alberta-government-egale-skipping-stone-legal-challenge-school-pronouns-1.7624418", "text": " Advocacy groups launch legal challenge to Alberta's new school pronoun law"}, {"url": "https://cbc.ca/news/canada/edmonton/alberta-government-promises-to-fight-for-school-pronoun-law-amid-legal-challenge-1.7628759", "text": " Alberta government promises to fight for school pronoun law amid legal challenge"}, {"url": "https://cbc.ca/news/canada/manitoba/quebec-bill-21-notwithstanding-clause-supreme-court-intervener-1.7637509", "text": " Courts should be able to rule on whether provincial laws violate Charter: Manitoba Supreme Court filing"}, {"url": "https://cbc.ca/news/canada/north/nunavut-non-binary-birth-certificate-1.7636903", "text": " Nunavut becomes last jurisdiction to create non-binary option on birth certificate"}]}, {"published": "Fri, 19 Sep 2025 10:07:44 EDT", "url": "https://www.cbc.ca/news/politics/kneecap-ineligible-canada-1.7638108?cmp=rss", "headline": "Hip-hop group Kneecap barred from entering Canada for supporting 'terrorist organizations'", "author": {"name": "Peter Zimonjic, Joseph Pugh", "url": "https://cbc.ca/news/politics/author/peter-zimonjic-1.3689630"}, "story": "The Irish hip-hop trio Kneecap has been banned from entering Canada over what the federal government says is their \"open endorsement of terrorist organizations.\"\"Kneecap has engaged in actions and have made statements that are contrary to Canadian values and laws that have caused deep alarm to our government,\" Vince Gasparro, parliamentary secretary for combating crime, said in a video posted on social media.  \"The group have amplified political violence and publicly displayed support for terrorist organizations such as Hezbollah and Hamas,\" he said. The band has denied supporting the militant groups.In announcing the group's ineligibility, Gasparro explained that his government would not allow Canada to become a platform for extremism or political violence Kneecap had been scheduled to perform in Toronto and Vancouver next month. Last month, the group announced it was cancelling 15 shows in the U.S.The Belfast trio is known for its anarchic energy, satirical lyrics and use of symbolism associated with the Irish republican movement, which seeks to unite Northern Ireland — currently part of the U.K. — with the Republic of Ireland.The group has faced criticism for lyrics laden with expletives and drug references, and for political statements seeming to glorify militant groups.One member of the group, Liam Óg Ó Hannaidh, who performs under the name Mo Chara, is facing terrorism charges in the U.K., after allegedly waving a Hezbollah flag on stage at a November 2024 gig in London. He returns to court Sept. 26.The ban comes on the same day Justice Minister Sean Fraser tabled new legislation that promises to create four Criminal Code offences, including one that would make it a crime to intentionally promote hatred against identifiable groups in public using certain hate- or terrorism-related symbols.On behalf of the Government of Canada I am announcing that on the advice of our officials, we have deemed the group Kneecap ineligible to enter our country.<br><br>Our government will not tolerate the advocating of political violence, terrorism or Anti-Semitism and hate more broadly. <a href=\"https://t.co/3KOf84G3bZ\">pic.twitter.com/3KOf84G3bZ</a>Jewish groups have been asking Ottawa to ban the group since June, along with the English punk-rap duo Bob Vylan, over comments they argue incite antisemitism. Gasparro's video did not mention Bob Vylan.B'nai Brith Canada, a Jewish advocacy group, welcomed the news Friday, saying the government's decision should set a precedent. \"Kneecap ... has repeatedly glorified violence and extremism — from waving a Hezbollah flag in London to inciting hostile chants at major festivals,\" the organization said in a press release. \"Their incitement is not just a danger to the Jewish community, it is a danger to Canadian values and to all Canadians.\"In his video message, Gasparro said the decision to ban Kneecap was taken specifically to protect Canada's Jewish community. Kneecap has accused its critics of trying to silence them because of their support for the Palestinian cause throughout Israel's war in Gaza. They have said they don't support Hezbollah and Hamas, nor do they condone violence.The band responded to Gasparro in a post on X, saying the allegations he made in the video are \"wholly untrue and deeply malicious.\" They said they would be taking legal action against him.\"We will be relentless in defending ourselves against baseless accusations to silence our opposition to a genocide being committed by Israel.\"The post also included a message to their Canadian fans.\"We have played in Canada many times with zero issues and a message of solidarity and love,\" it read. \"We are sorry we cannot be with you next month but we will not be silenced and will always oppose genocide.\"The federal government has the powers under the Immigration and Refugee Protection Act to deny someone entry to to Canada based on a number of reasons, including:The ministers of public safety or immigration can also deny entry to someone if, in the opinion of the minister, the person seeking entry is a national security or public safety threat.Immigration lawyer and policy analyst Richard Kurland told CBC News that Indigenous people, permanent residents and Canadian citizens can enter the country by right; all others can be turned away under the law. Kurland also said that the language the federal government uses to describe categories of inadmissibility are deliberately broad — for example saying someone \"committed\" an offence without clarifying if that means being charged or convicted — because immigration decisions do not rise to the standard of court rulings. \"So if there is information or evidence to the effect that there's a reasonable suspicion the person will commit a hate crime, that's enough,\" he added. Kurland says that because it was a government decision to ban Kneecap from entering Canada, the band can only apply for a judicial review, rather than challenge the decision in court. A judicial review, however, does not re-examine merits of the person's entry request, but instead looks at whether an error of law was made in refusing them entry. Kurland says that because ministers have the authority to act on a \"reasonable suspicion\" and one of the group's members is facing terrorism charges, the case would likely not go very far.", "relatedStories": [{"url": "https://cbc.ca/news/canada/irish-band-kneecap-keeps-canada-tour-dates-1.7617813", "text": " Kneecap keeps Canadian tour dates, cancels U.S. shows due to court hearing"}, {"url": "https://cbc.ca/news/entertainment/uk-ireland-kneecap-controversy-1.7521512", "text": " Irish hip-hop trio Kneecap under fire for British MP and anti-Israel comments"}, {"url": "https://cbc.cahttps://www.bbc.com/news/articles/cly5r4gg7l6o", "text": " Kneecap: Rap group are no strangers to controversy, but is this time different?"}]}, {"published": "Fri, 19 Sep 2025 18:56:29 EDT", "url": "https://www.cbc.ca/sports/olympics/summer/athletics/track-and-field-world-athletics-championships-1-1.7638295?cmp=rss", "headline": "Injury forces 2021 Olympic champ Damian Warner to withdraw from decathlon at World Athletics Championships", "author": {"name": "Devin Heroux", "url": "https://cbc.ca/sports/author/devin-heroux-1.2981459"}, "story": "Damian Warner's attempt to win his first world championship title won't be happening in Tokyo. The 2021 Olympic champion decathlete from Canada is withdrawing from the competition with an Achilles injury. The competition is scheduled for Saturday morning in Tokyo. In an Instagram post, the London, Ont., resident said while it wasn't torn, and MRI did reveal swelling and fluid in the tendon.\"I'm devastated, especially because I had been feeling so strong leading into this trip and was really looking forward to once again representing Canada on the world stage,\" Warner said in the post.Warner has won two silver medals in eight world championships, including at the most recent worlds held two years ago in Budapest. The 35-year-old was eager to return to competition inside Japan's National Stadium, the same venue where he broke the Olympic record to win decathlon gold four years ago. Warner arrived in Tokyo two weeks ago and had been training and preparing in Gifu, Japan, before making his way to Tokyo for the start of the event. He became the fourth man ever to break the 9,000 point barrier to become Olympic champion inside a mostly empty stadium in the midst of the pandemic. This is now back-to-back summers of disappointment for Warner, who at last year's Olympics in Paris fell out of contention and withdrew after failing to clear the bar in the pole vault.WATCH | CBC Sports' Devin Heroux explains Warner's latest injury:Damian Warner will not compete in the decathlon at the World Athletics Championships\"I feel like one of the important things about being a track athlete is having a short-term memory,\" Warner told CBC Sports earlier this year. \"When you have failures or things don't go your way, you have to be able to stew in that moment and just kind of be upset at yourself and kind of draw as much as you can from that performance to be better.\"Warner returned to action this past May, finishing sixth at the Hypo Meeting in Austria , an event he's won eight times.While Warner has withdrawn from the event, reigning champion Canadian Pierce LePage is set to compete in the two-day, 10 event decathlon. WATCH | Trackside recaps Day 7 of the World Athletic Championships:World Athletics Championships day 7 reaction; Donovan Bailey reacts to the 200m finalLePage won gold at the 2023 world championships, but has been plagued by injury for more than a year and had to withdraw from the Paris Olympics.The conclusion of the decathlon comes Sunday evening inside Japan's National Stadium.", "relatedStories": [{"url": "https://cbc.ca/sports/olympics/summer/athletics/track/morgan-campbell-fred-kerley-enhanced-games-1.7638207", "text": "Analysis Sprint star Fred Kerley a boost to Enhanced Games, but he can't race by himself"}, {"url": "https://cbc.ca/sports/olympics/summer/athletics/track/morgan-campbell-fred-kerley-enhanced-games-1.7638207", "text": "Analysis Sprint star Fred Kerley a boost to Enhanced Games, but he can't race by himself"}, {"url": "https://cbc.ca/sports/olympics/summer/athletics/track-and-field-world-athletics-championships-1-1.7638026", "text": " World champion Evan Dunfee pulls out of men's 20km race walk with hamstring tear"}, {"url": "https://cbc.ca/sports/olympics/summer/athletics/track-and-field-world-athletics-championships-9-1.7635864", "text": " Noah Lyles sprints to 4th world title win in men's 200m"}]}, {"published": "Fri, 19 Sep 2025 15:14:28 EDT", "url": "https://www.cbc.ca/news/business/toyota-recall-instrument-panel-issue-canada-70000-vehicles-1.7638684?cmp=rss", "headline": "Toyota recalling over 70,000 vehicles in Canada over instrument panel issue", "author": null, "story": "Toyota is recalling 70,480 vehicles in Canada due to an issue with the instrument panel display that does not show critical information, increasing the risk of a crash or injury, Transport Canada said in a recall notice updated on Thursday.The recall, originally dated Sept. 11, covers several models including Venza, Highlander, Tacoma and GR Corolla, as well as some Lexus models, the agency said. The recall only impacts vehicles with a 12.3-inch display.The instrument panel may fail to display vehicle speed, brake system, and tire pressure warning lights due to an error in the instrument panel software at vehicle startup, according to the notice.\"The company will notify owners by mail and advise you to take your vehicle to a dealership to update the combination meter software,\" said Transport Canada.\"For certain vehicles, the dealer will also inspect and, if necessary, replace the combination meter.\"Toyota Canada will notify affected vehicle owners by mid-November, the company said in a statement published on its website last week.", "relatedStories": [{"url": "https://cbc.ca/news/business/vehicle-recalls-canada-road-safety-explainer-1.7168205", "text": " Something wrong with your car? Here's how Canada's vehicle recall system works"}]}, {"published": "Fri, 19 Sep 2025 06:00:00 EDT", "url": "https://www.cbc.ca/news/canada/sudbury/failed-road-test-tesla-regenerative-brakes-1.7637348?cmp=rss", "headline": "North Bay, Ont., man says his daughter failed her road test because she didn't use his Tesla's brakes", "author": {"name": "Jonathan Migneault", "url": "https://cbc.ca/news/canada/sudbury/author/jonathan-migneault-1.6158189"}, "story": "A man from North Bay, Ont., says his teenage daughter failed her road test for her G driver's licence because she was driving his Tesla Model Y and only used the car's regenerative braking to slow down.Electric vehicles and hybrids have the option to use regenerative braking, where the vehicle's electric motor is reversed and slows the vehicle to a stop.\"Essentially you can come to a full stop without even touching the brake pedal,\" said Eric Simard.But Simard said his daughter failed because she never used the car's brakes.He said his daughter was borrowing his car for the test, so she didn't know how to turn off the feature and was told she couldn't pause the test to call him.Simard shared his daughter's road test results from Drive Test Ontario with CBC News. In them, the examiner marked a box indicating the vehicle was \"out of order.\"\"I find it pretty frustrating because even though it's regenerative braking and you're not using the brake pedal, you're clearly the one that is in full control of making the vehicle come to a stop or to slow down,\" he said.The regenerative braking only kicks in when the driver eases their foot off the accelerator pedal, which Simard argued shows intent to slow down at a specific time.Simard added his daughter was also docked for a feature in his Tesla that chimes when a traffic light turns green.In an email to CBC News, Julia Caslin, a spokesperson for Ontario's Ministry of Transportation, said the province's graduated licensing system \"requires drivers to always demonstrate safe vehicle operation and full control, regardless of the vehicle's features.\"\"Applicants are expected to understand how their vehicle's system — including lane centring, regenerative braking, adaptive cruise control and automated parking — may affect handling and performance during a road test.\"Caslin did not say if there are specific requirements to use a vehicle's brake pedal to come to a full stop if regenerative braking is also an option.Simard said he posted about his daughter's experience in a Facebook group for Ontario Tesla owners, and some people reported they were fine using regenerative braking in their road tests. Others said their examiner asked them to turn off the feature.The Drive Test Ontario website does not address the question, but does speak about another technology: rear-view cameras.The website says drivers can use their rear camera during their road test, but must also show good observation skills.\"This means turning your head, checking mirrors and looking around while backing,\" the website says.Saad Tariq, a driving instructor and owner of the Greater Sudbury Driving School, said he's not aware of any written rules banning the use of assistive technologies in Ontario road tests.But Tariq said he discourages his students from using such technologies when he's teaching them.\"My vehicles that I teach in don't have blind-spot detectors, they don't have rear cameras,\" he said.\"So you actually have to look around and do all the basic skills yourself.\"Tariq said that sensors on newer vehicles can easily be covered by snow or dirt in poor weather conditions, at which point they no longer work. In those cases, he said, it's especially important that drivers know how to handle their vehicles without them.Amanda Lacroix, a driving instructor with the Northern Lights Driving School in the Levack community of Greater Sudbury, said she has mixed feelings about driver assistance technologies.She said using driver assistance should be allowed for final road tests, for a G driver's licence, if the car that individual regularly drives uses those features.\"If the world's going to change and we're all going to have assisted driving, then we should be learning how to do it properly.\"But Lacroix said she also agrees with Saad that drivers should know how to control their vehicles, and properly use their mirrors, even if their vehicles are equipped with the latest technology.", "relatedStories": [{"url": "https://cbc.ca/news/canada/windsor/sarnia-drive-test-centre-crash-1.7620207", "text": " Yes, a driver crashed into an Ontario drive test centre. Here's what happened"}, {"url": "https://cbc.ca/news/canada/toronto/toronto-micromobility-device-police-campaign-1.7616942", "text": " Toronto police target e-bike, e-scooter riders in 'needed' enforcement blitz"}, {"url": "https://cbc.ca/news/canada/toronto/cristillo-family-calls-for-tougher-laws-dangerous-driving-ontario-1.7616918", "text": " Family of Ontario father killed by alleged dangerous driver calls for tougher laws"}, {"url": "https://cbc.ca/news/canada/london/ontario-daycare-parking-rules-accessibility-issues-1.7636429", "text": " Ontario's stricter parking rules after deadly daycare crash cause confusion, raise accessibility concerns"}, {"url": "https://cbc.ca/news/canada/hamilton/careless-driving-charges-sept-4-2025-1.7624843", "text": " Driver charged in July collision that killed child in St. Catharines, Ont."}]}, {"published": "Fri, 19 Sep 2025 12:37:51 EDT", "url": "https://www.cbc.ca/news/politics/ottawa-hate-symbols-1.7638237?cmp=rss", "headline": "Government tables legislation targeting hate symbols, protecting places of worship", "author": {"name": "Ben Andrews", "url": "https://cbc.ca/news/canada/ottawa/author/ben-andrews-1.6096634"}, "story": "Justice Minister Sean Fraser tabled new legislation Friday introducing four Criminal Code offences, including one that would make it a crime to intentionally promote hatred against identifiable groups in public using certain hate- or terrorism-related symbols.If passed, the Combatting Hate Act would target symbols used during the Holocaust, such as the swastika and SS lightning bolts, or associated with the government's list of terrorist entities, which includes the Proud Boys, Hamas and Iran's Islamic Revolutionary Guard Corps.It would, for instance, make it a crime to promote hatred against Jewish people using Hamas flags or swastika signs outside a synagogue.It would also make hate-motivated crime a specific offence and crack down on willfully intimidating and obstructing people outside places of worship and other sensitive institutions.Multiple Canadian municipalities are currently grappling with the issue through the use of \"bubble\" bylaws that allow for buffer zones around certain locations, and Fraser stressed that the authority for regulating spaces \"in general terms\" falls with local councils — not the federal government.The legislation also adds two further measures that would make it easier to prosecute individuals found to have wilfully promoted hatred: adding a definition of \"hatred\" to the Criminal Code; and removing a requirement for the consent of the provincial attorney general to prosecute a hate crime.\"This behaviour is not just morally culpable, the impact has reverberations through the entirety of the community. And, I would argue, tears at the seams of the social fabric of the nation,\" Fraser said in a Friday afternoon news conference.The government had promised to address a recent rise in hate incidents in Canada, including acts of antisemitism and Islamophobia.The total number of police-reported hate crimes across the country increased to 4,882 incidents last year, up from 2,646 in 2020, according to Statistics Canada.The Conservatives, who have hammered the Liberals on crime early in the fall parliamentary sitting, have criticized the government for taking too long to act on the issue.Likewise, Jewish and Muslim groups say a federal response to acts of violence, vandalism and hate is long overdue.Now that the government's response has been tabled, some organizations are raising concerns over whether the bill could be used to infringe on the right to peaceful protest.The Canadian Civil Liberties Association (CCLA) takes issue with the use of the Criminal Code, referring to it as a \"blunt instrument\" that may not be best suited to addressing the goal of protecting identifiable groups.\"We are concerned that the government might move away from a strict public safety agenda, and instead use the bill to criminalize unpopular, dissenting and offensive speech,\" said CCLA lawyer Anaïs Bussières McNicoll.Fraser said the bill includes specific language exempting peaceful protest from persecution and would only apply to conduct where the \"motivation\" is to intimidate or prevent someone from practising their faith.\"We have included specific provisions to exempt peaceful protest,\" Fraser said.Stephen Brown, CEO of the National Council of Canadian Muslims, said he is broadly supportive of the legislation.He said it addresses long-standing requests from the Muslim community, such as the specific \"free-standing\" provision for hate crimes, but added that success moving forward will hinge on whether the bill can protect minority groups while preserving civil liberties.\"Finding the right balance is what's important,\" Brown said.The council does, however, have lingering concerns over how the law will be applied and whether law enforcement will properly distinguish between what does and does not count as a hate symbol.The law as currently written explicitly targets symbols used by Nazis and listed terrorist entities, but also covers anything that \"so nearly resembles\" those symbols it could be confused for one of them.Fraser said that language helps to \"protect against counterfeits.\"Richard Marceau, vice-president of external affairs with the Centre for Israel and Jewish Affairs, said he would have liked to see hate symbols banned outright, rather than merely when they are used to promote hate in public.Marceau nonetheless called the bill a \"step in the right direction,\" following two years in which Jewish community centres, schools and synagogues have been \"under siege.\"\"Having this [legislation] is an important message that this will not stand.\"", "relatedStories": [{"url": "https://cbc.ca/news/politics/hate-symbols-bill-1.7636559", "text": " Government to table bill Friday criminalizing use of certain symbols to promote hate"}, {"url": "https://cbc.ca/news/politics/new-legislation-protecting-religious-cultural-buildings-1.7631867", "text": "Exclusive Carney government introducing bill to protect people entering religious, cultural buildings"}]}, {"published": "Fri, 19 Sep 2025 12:51:48 EDT", "url": "https://www.cbc.ca/news/world/chalk-up-a-win-for-soft-power-as-donald-trump-heads-home-from-britain-happy-1.7638086?cmp=rss", "headline": "Chalk up a win for soft power as Donald Trump heads home from Britain happy", "author": {"name": "Chris Brown", "url": "https://cbc.ca/news/world/author/chris-brown-1.6728329"}, "story": "For all the Royal effort that went into ego-stroking Donald Trump this week during his unprecedented second state visit to the U.K., his trip also underscored at least two significant developments for transatlantic policymakers.Both involve issues where the U.K. — and Canadian — governments hold conflicting views to the U.S. president.The first is Israel's war in Gaza.British Prime Minister Keir Starmer said the U.K. will announce this weekend its recognition of a Palestinian state, alongside Canada, Australia, France and other Western countries.Officials in Trump's administration have made their opposing views quite clear.\"We actually think it [recognition] has undermined negotiations, because it emboldened Hamas, and we think it undermines future prospects of peace in the region,\" U.S. Secretary of State Marco Rubio said about the issue on the eve of Trump's U.K. visit.Rubio's position echoes those of the largest Jewish community organizations in Canada, the U.K. and Australia, who, in a joint release, argue Palestinian statehood would be \"a reward for violence and rejectionism.\"But in his remarks Thursday, Starmer categorically rejected that position, with the U.S. president listening beside him. \"The question of recognition needs to be seen … [as] part of that overall package, which hopefully takes us from the appalling situation we're in now to the outcome of a safe and secure Israel, which we do not have, and a viable Palestinian state.\"Prime Minister Mark Carney issued a statement using similar words over the summer, noting that Israel's ongoing failure to \"prevent the rapidly deteriorating humanitarian disaster in Gaza,\" along with the imperative of preserving a two-state solution, was behind Canada's decision to act now.While Trump pointedly disagreed with Starmer's — and, implicitly, Carney's — position on recognition, he also said he wasn't going to do anything about it.\"I have a disagreement with the prime minister on that score, OK? One of our few disagreements, actually.\"One of Britain's most respected foreign policy experts says Trump's response is notable.\"He [Trump] chose a kind of affable, 'Let's agree to disagree on that,' which I think is a green light for Keir Starmer now to go ahead with the recognition of Palestine,\" said Peter Ricketts, a member of Britain's House of Lords and former prime minister Tony Blair's top national security official.\"American opposition was muted, and I suspect the Israelis would have been extremely disappointed to see that,\" Rickets told BBC Radio 4, Today Program.As Canada opens up discussions with the United States on renewing the Canada-U.S.-Mexico Agreement on trade (CUSMA), there have been widespread concerns that Canada's position on Palestinian statehood could jeopardize those talks — but Trump's comments in the U.K. could suggest otherwise. Just how useful recognition of a Palestinian state is, with Gaza being pummelled for two years by Israeli forces and Jewish settlers in the occupied West Bank increasingly emboldened and staging almost daily attacks on Palestinians and their properties, is highly debatable. Trump repeated that no discussions about Gaza's future will happen on his watch, unless the 20 Israeli hostages believed to still be alive and held by Hamas are returned.But in Europe, Canada and much of the rest of the world, there's deep concern that Trump's explicit approval of Israel's attacks on Gaza have emboldened those on Israel's far-right who want to occupy and settle Gaza permanently — and if Trump doesn't act quickly to restrain Prime Minister Benjamin Netanyahu and halt Israel's offensive on Gaza City, it will be too late for any future Palestinian state.Trump, Starmer disagree over Palestinian state as visit wrapsThe other notable development from the state visit came on the future of Trump's efforts to end Russia's war on Ukraine.Since he took office eight months ago, the U.S. president has undergone an evolution, of sorts, in his attempts at peacemaking.Beginning with the infamous dressing down of Volodymyr Zelenskyy in the Oval Office, where he proclaimed Ukraine's president \"had no cards\" and exhorted him to simply cut his losses and settle, Trump has gradually, reluctantly shifted his position.Starmer has played a significant role in that shift, as he counselled Zelenskyy on his dealings with Trump but also made his own interventions on behalf of the U.K. and Europe.Speaking at Thursday's news conference, Trump's key message on Ukraine was that Europe needs to do more to hit Russia where it hurts: namely, stop buying its energy.\"The thing that was most striking to me, that he was willing to say stuff out loud that everyone knows but no one is prepared to necessarily recognize,\" said Tom Keatinge, founding Director of the Centre for Finance and Security (CFS) at London's Royal United Services Institute.\"That was his point about the EU essentially funding Russia's war in Ukraine.\"While Europe has drastically cut back on purchases of oil and natural gas from Russia since the beginning of its invasion of Ukraine in 2021, it has not stopped altogether.The EU — mostly Hungary and Slovakia — still buys two per cent of its oil from Russia and 14 per cent of its natural gas. One European energy-tracking website noted EU imports of Russian fossil fuels was higher than the total amount of financial aid the bloc sent to Ukraine in 2024.\"It's a stain on the continent,\" Keatinge told journalists on a conference call with the London-based Foreign Press Association. \"The lack of willingness to address that is a problem, and I think Donald Trump is basically forcing the EU to do what it should have done a long time ago.\"Trump spoke repeatedly about how Putin has disappointed him and \"really let him down\" since the pair held their summit in Anchorage, Alaska, in mid-August.Standing next to Starmer, Trump suggested — as he has frequently in the past — that he can hit Russia's economy much harder than he has, but he won't do so unless Europe goes first.\"I'm willing to do other things. But not when the people that I'm fighting for are buying oil from Russia. If the oil price comes down, very simply, Russia will settle.\"On Friday, the European Union confirmed it had passed a new package of sanctions against Russia, its 19th since the start of its attack on Ukraine. The new measures include a complete ban on EU countries buying Russian natural gas, as well as more sanctions on the ships that transport Russian fossil fuels around the world.The effect the new measures will have in deterring Putin may be limited, but Ricketts says Trump's slow shift on the issue of sanctions, at the behest of urging from Starmer and European leaders, is notable.\"If we can channel that into a proposal for sanctioning companies, individuals engaged in the oil trade, then that is a practical proposal,\" the former national security advisor said. \"So there's a door open there we can walk through.\"Other observers vehemently reject any suggestion that Starmer's efforts this week to ingratiate himself with the unpredictable U.S. president can lead to better outcomes for the U.K.Ben Jamal, of Palestine Solidarity Campaign, who participated in the large street demonstrations in London against Trump's visit, says the U.S. president is a bully — and trying to play nice with him will inevitably backfire. \"What we see at the moment is what I would describe as an absolute appeasement of President Trump,\" Jamal told CBC News in an interview. \"The only purpose of influence is to use it to say, 'What you're doing is wrong, it's not what we stand for and we urge you and demand that you change course.'\"And we don't do that by saying, 'Come along and have an unprecedented state visit and we'll roll out the red carpet to you.'\"Just how much this trip ended up helping Starmer politically at home, is highly subjective.He continues to face intense pressure from within his Labour Party for continuing to trade with Israel and welcoming its senior officials to London on official visits. And on the political right, he faces increasing competition from the upstart Reform UK, which has challenged Labour on what it says are its \"weak\" immigration policies.Still, as he ends the week, Britain's prime minister will likely see the state visit as an overall win, with no major gaffes, no open rifts with Trump and promises of billions of dollars in deals in the years ahead.", "relatedStories": [{"url": "https://cbc.ca/news/world/trump-state-visit-uk-1.7634934", "text": " Donald Trump's U.K. state visit: What to watch for"}, {"url": "https://cbc.ca/news/world/trump-starmer-uk-immigration-1.7634875", "text": " Trump's U.K. visit looked like it would be dominated by trade. Immigration protests suggest otherwise"}, {"url": "https://cbc.ca/news/world/donald-trump-state-visit-king-charles-banquet-speech-1.7636746", "text": " How Donald Trump's and King Charles's state visit speeches compared"}, {"url": "https://cbc.ca/news/world/uk-ambassador-mandelson-dismissal-1.7630886", "text": " Britain's ambassador to U.S., longtime friend of Jeffrey Epstein, relieved of duties"}, {"url": "https://cbc.ca/news/politics/canada-mexico-agree-new-partnership-1.7637709", "text": " Canada, Mexico agree to deepen ties in face of Trump's turbulent 2nd term"}]}, {"published": "Fri, 19 Sep 2025 14:54:55 EDT", "url": "https://www.cbc.ca/news/entertainment/jesus-take-the-wheel-songwriter-brett-james-dies-in-plane-crash-1.7638600?cmp=rss", "headline": "Jesus, Take The Wheel songwriter Brett James dies in plane crash", "author": null, "story": "Grammy-winning country songwriter Brett James, whose string of top hits includes Jesus, Take the Wheel by Carrie Underwood and When the Sun Goes Down by Kenny Chesney, died in a plane crash in North Carolina, authorities said Friday. He was 57.The small plane with three people aboard crashed Thursday afternoon \"under unknown circumstances\" in the woods in Franklin, the U.S. Federal Aviation Administration (FAA) said in a preliminary report. There were no survivors, the North Carolina State Highway Patrol said in a statement. James was on a Cirrus SR22T, which was registered to him under his legal name of Brett James Cornelius, according to information provided by the FAA.It was not known whether James was the pilot. The patrol confirmed his death. The FAA and National Transportation Safety Board said they will investigate the crash. The other two people on the plane were Melody Carole and Meryl Maxwell Wilson, the patrol said. The plane had taken off from John C. Tune Airport in Nashville.James was inducted into the Nashville Songwriters Hall of Fame in 2020. The organization posted an online statement of mourning. A native of Oklahoma City, James left medical school to pursue a musical career in Nashville, according his biography on the Hall of Fame's site. His first No. 1 hit was Who I Am in 2001, by Jessica Andrews. Jesus, Take the Wheel, which he co-wrote along with Hillary Lindsey and Canadian Gordie Sampson for Underwood, earned the 2006 Grammy for best country song, among other honours.James had more than 500 of his songs recorded, for albums with combined sales of more than 110 million copies, according to his Grand Ole Opry biography online.Other artists who sang his songs include Faith Hill, Kelly Clarkson, Luke Bryan, Keith Urban, Nick Jonas and Meghan Trainor. Additional hits include Cowboy Casanova by Underwood, Out Last Night by Chesney, and Summer Nights by Rascal Flatts.\"Heartbroken to hear of the loss of my friend Brett James tonight,\" country singer Jason Aldean posted on X.\"I had nothing but love and respect for that guy and he helped change my life. Honoured to have met him and worked with him.\"James recorded his own album in 2020.\"At my stage in life, I'm not going to write about driving around in pickup trucks, chasing girls,\" he was quoted as saying on the Opry site.\"It needed to feel more classic, lyrically. They all wound up being love songs, but hopefully love songs with a twist, that haven't all been written before.\"", "relatedStories": [{"url": "https://cbc.ca/news/entertainment/mastodon-brett-hinds-1.7615562", "text": " Former Mastodon singer-guitarist Brent Hinds dead at 51 in motorcycle crash"}, {"url": "https://cbc.ca/news/entertainment/brandon-blackstock-dead-at-48-kelly-clarkson-1.7604071", "text": " Brandon Blackstock, Kelly Clarkson's ex-husband and former manager, dies at 48"}]}, {"published": "Fri, 19 Sep 2025 13:42:10 EDT", "url": "https://www.cbc.ca/news/world/estonia-airspace-russia-1.7638294?cmp=rss", "headline": "NATO, EU condemn Russia as Estonia says airspace was violated for 12 minutes", "author": null, "story": "Estonia summoned a Russian diplomat to protest after three Russian fighter aircraft entered its airspace without permission Friday and stayed there for 12 minutes, the Foreign Ministry said.The apparent incursion comes just over a week after NATO planes downed Russian drones over Poland and heightened fears that the war in Ukraine could spill over.Estonian Foreign Minister Margus Tsahkna said that Russia had already violated the country's airspace four times this year, \"but today's incursion, involving three fighter aircraft entering our airspace, is unprecedentedly brazen.\"Estonia has decided to request NATO Article 4 consultations over the violation of its airspace, Prime Minister Kristen Michal wrote on X on Friday. Article 4 allows NATO countries to hold consultations with allies when they believe their territorial integrity, political independence or security is threatened.Russian officials did not immediately comment.Russia's violation of Poland's airspace was the most serious cross-border incident into a NATO member country since the war in Ukraine began with Russia's all-out invasion in February 2022.Other alliance countries have reported similar incursions and drone crashes on their territory.Is Russia provoking Poland into war? | About ThatThe European Union's foreign policy chief, Kaja Kallas, a former prime minister of Estonia, called Friday's incursion \"an extremely dangerous provocation\" that \"further escalates tensions in the region.\"Estonia, along with other Baltic states Lithuania and Latvia, is seen as being among the most likely targets if Russia one day decides to risk an attack on NATO.The Russian MiG-31 fighters entered Estonian airspace in the area of Vaindloo Island, which is a small island located in the Gulf of Finland in the Baltic Sea, the Estonian military said in a separate statement.The aircraft did not have flight plans and their transponders were turned off, the statement said, nor were the aircraft in two-way radio communication with Estonian air traffic services.Italian Air Force F-35 fighter jets, currently deployed as part of the NATO Baltic Air Policing Mission, responded to the incident, according to the statement.\"Russia's increasingly extensive testing of boundaries and growing aggressiveness must be met with a swift increase in political and economic pressure,\" Tsahkna, the foreign minister, said. The Russian charge d'affaires was summoned and given a protest note, a ministry statement said.Russian drones landed in Polish regions last week: The developments have increasingly rattled European governments as efforts to stop the war in Ukraine have not sustained momentum after a flurry of diplomatic talks that included U.S. President Donald Trump hosting Russian President Vladimir Putin in Alaska on Aug. 15, and a Europe-led \"coalition of the willing\" has been formulating plans on how to support a post-war Ukraine.Analysts say Putin believes he can outlast the political commitment of Ukraine's Western partners and win a protracted war of attrition by wearing down Ukraine's smaller army with sheer weight of numbers.The war has continued unabated for over 3½ years since Russia invaded its neighbour. Ukraine has accepted proposals for a ceasefire and a summit meeting, but Moscow has demurred.Ukraine, meanwhile, is racing to expand its defence co-operation with other countries and secure billions of dollars of investment in its domestic weapons industry.  Trump said Thursday during a state visit to the United Kingdom that Putin \"has really let me down\" in peace efforts. But at other times the U.S. president has appeared to blame Ukraine for inviting the invasion, and last week took aim at NATO alliance members who've purchased Russian energy. The European Union plans to ban Russian LNG imports into the bloc a year earlier than envisaged as part of a 19th package of sanctions against Moscow, EU officials said on Friday, a change that follows Trump's pressure.\"The revenues from fossil fuels sustain Russia's war economy. We want to cut these revenues,\" said European Commission President Ursula von der Leyen, as she announced the proposal, which requires unanimous approval from EU governments.\"It is time to turn off the tap,\" von der Leyen added.Beyond LNG, or liquefied natural gas, the proposed sanctions would also target more of Russia's shadow tanker fleet and cryptocurrency.Von der Leyen and Kallas did not give full details of the new package, but officials said it would seek to neutralize a customs loophole used by Moscow to import dual-use goods for its military.\"We are now going after those who fuel Russia's war, who purchase oil in breach of sanctions,\" von der Leyen said. \"We target refineries, oil traders, petrochemical companies in third countries including China.\"The proposal risks compelling EU countries to cover any shortfalls in LNG supplies through purchases from the United States, increasing their energy dependency on the U.S. in an era when Washington is using trade tariffs as a policy tool.Russia's share in EU imports of LNG decreased to 14 per cent in the second quarter of 2025 from 22 per cent in the first quarter of 2021, according to Eurostat. Spain, Belgium, the Netherlands and France import Russian LNG. Gas piped via TurkStream goes to Slovakia, Hungary and Bulgaria.Kremlin spokesperson Dmitry Peskov said Wednesday that any EU proposal to phase out Russian energy more quickly would not affect Russia and would not force it to change its position.", "relatedStories": [{"url": "https://cbc.ca/news/world/gps-jamming-russia-eu-1.7622449", "text": " Russian interference suspected in GPS jamming of EU leader's plane above Bulgaria"}, {"url": "https://cbc.ca/news/world/poland-drones-shot-down-1.7629795", "text": " Poland shoots down at least 3 Russian drones in its airspace"}, {"url": "https://cbc.ca/news/world/poland-trump-russia-drones-1.7632051", "text": " Polish officials insist Russian drones weren't in airspace by mistake, as suggested by Trump"}, {"url": "https://cbc.ca/news/world/poland-nato-1.7630155", "text": " Poland says it found 14 Russian drones on its territory. Just how will NATO respond?"}, {"url": "https://cbc.ca/news/world/ukraine-yarova-donetsk-attack-1.7628694", "text": " At least 24 civilians killed in Russian airstrike in eastern village, Ukrainian officials say"}]}, {"published": "Fri, 19 Sep 2025 17:01:54 EDT", "url": "https://www.cbc.ca/news/canada/british-columbia/evan-dunfee-speaks-out-against-enhanced-games-1.7638399?cmp=rss", "headline": "'Valueless spectacle': World champion Evan Dunfee speaks out against Enhanced Games", "author": {"name": "Karin Larsen", "url": "https://cbc.ca/news/canada/british-columbia/author/karin-larsen-1.3041527"}, "story": "Evan Dunfee's historic gold medal at the World Athletics Championships in Japan is proving meaningful in ways he never imagined. That's because after hearing O Canada from the top of the podium and collecting $70,000 US in prize money, the Richmond, B.C., race walker seized an opportunity brought about by his elevated profile to speak out on something he cares deeply about: ethical sport.It all started with a social media message from someone who said they work for the Enhanced Games, congratulating Dunfee on his win and winner's cheque.The Enhanced Games is a new billionaire-backed multi-sport venture with no rules around the use of performance-enhancing drugs and no testing. \"To get a message from somebody ... mentioning their association with the Enhanced Games, thinking that I, of all people, wouldn't find that deplorable, was very interesting,\" said Dunfee, a KidSport ambassador and frequent school speaker.His response to the overture on social media read in part:\"My message is that an athlete's value is in showing their communities that a dream, any dream, is worth chasing. That the pursuit of that dream is what transforms us as individuals for the better. The enhanced games are the antithesis of that message ... a valueless spectacle that jeopardizes the ability of clean athletes to inspire their neighbours.\"Dunfee said he is bothered by the Enhanced Games' pitch that it is pushing the envelope of sport science when what he believes organizers are really messaging is \"doping to the gills and taking home bags of cash.\"\"Something like the Enhanced Games, where that moral contract is broken, it's no longer about achieving personal potential, it's about manufacturing yourself into something unhealthy, and potentially dangerous,\" he said.Canadian Evan Dunfee makes history as world champion in 35-km race walkOne of Canada's pre-eminent sports physiologists feels the same.Trent Stellingwerff, chief performance officer at the Canadian Sports Institute Pacific, said the Enhanced Games' promotion of no-holds-barred doping makes him think of professional wrestling.\"I joke that the WWE was like the beta version of this,\" said Stellingwerff. \"There's at least two published studies I'm aware of where the life expectancy of those wrestlers — and there's a whole host of other reasons —  is incredibly short. Eight to 16 per cent of them are dying before the age of 50.\"Stellingwerff will be in Toronto next week for a sport science symposium featuring a presentation from the Enhanced Games CEO.\"I have some questions I hope to ask in a fair and collaborative way just to understand that when they talk about science, are they going to publish? What ethics committee would ever approve [unlimited doping]? What scientific journal are they going to put their research in?\" he said. \"I want to ask the CEO next week, would you put your children in [the Enhanced Games]?\"By contrast, Stellingwerff said his focus is using modern knowledge in the best possible way while protecting and supporting athletes' long-term physical and mental health and happiness.The Enhanced Games have garnered widespread condemnation. World Aquatics, the governing body for swimming, announced that any athlete, coach or official who participates in the games will be banned for life, while the head of the U.S. Anti-Doping Agency has called it a \"dangerous clown show.\"Perhaps ironically, the cheque Dunfee is cashing after 20 years of striving for a world title would have been smaller if not for the penalties assessed to dope cheat nations.\"World Athletics gold medal prize money is $70,000, which interestingly is elevated from $60,000 off of money that Russia had to pay as a fine for their historic doping issues,\" he said.", "relatedStories": [{"url": "https://cbc.cahttps://www.cbc.ca/news/canada/british-columbia", "text": " Top stories from British Columbia"}, {"url": "https://cbc.ca/news/canada/british-columbia/david-teboul-regional-rcmp-commander-assault-choking-charges-abbotsford-1.7638595", "text": " RCMP regional commander charged with assault, choking while off duty in B.C."}, {"url": "https://cbc.ca/news/canada/british-columbia/chinese-shipyard-b-c-ferries-vessels-chrystia-freeland-1.7638242", "text": " Freeland called back to testify on B.C. Ferries' deal with Chinese shipyard"}, {"url": "https://cbc.ca/news/canada/british-columbia/blair-donnelly-trial-closing-arguments-light-up-chinatown-festivals-2023-stabbings-1.7638193", "text": " B.C. man who claims he stabbed 3 on 'God's will' isn't responsible, lawyer argues"}]}, {"published": "Fri, 19 Sep 2025 12:04:22 EDT", "url": "https://www.cbc.ca/news/health/cdc-mmrv-vaccine-1.7637070?cmp=rss", "headline": "RFK Jr.'s vaccine advisers change guidance around COVID shots, MMRV vaccines for young kids", "author": {"name": "Abby Hughes", "url": "https://cbc.ca/news/author/abby-hughes-1.6814144"}, "story": "A CDC panel of experts changed some of their guidance on COVID-19 vaccines on Friday, a day after changing their recommendations around the measles, mumps, rubella and varicella (MMRV) vaccine for kids.The Friday vote takes a step back on recommending the COVID-19 shot. Rather than recommending it outright for most adults as the panel has in the past, it voted that it should be available to everyone, and people should make a personal decision about whether or not to get it alongside their doctor.It also recommended advising patients on more potential risks associated with COVID-19 shots and narrowly avoided urging states to require a prescription for the shot.The Advisory Committee on Immunization Practices was also considering a change regarding the hepatitis B vaccine for newborn babies, but that decision was shelved indefinitely during the meeting, which at times veered into chaos and argumentation between members.The panel was hand-selected by Health and Human Services Secretary Robert F. Kennedy Jr., who ousted all of the advisory panel's previous 17 members. He appointed eight new experts to the panel days later, and then added another five this week — many of whom have been skeptical of vaccine safety and accused of spreading misinformation.Data from the U.S. Centers for Disease Control and Prevention (CDC) shows that COVID-19 vaccines provide the strongest protection against severe infection and death, even if people still become infected. A number of concerned doctors and members of the public weighed in with concerns regarding the evidence the panel heard, which questioned the safety of the vaccines.RFK Jr. vs. U.S. Senate: The 3-hour vaccine showdownFollowing Friday's meeting, the president of the American Pediatric Association (AAP) warned that the panellists' comments and questions showed a lack of knowledge about vaccines.\"What we're seeing is what happens when individuals who don't have a basic understanding about how vaccines are delivered are making these crucial policy decisions for the American public. They don't know what they're doing,\" said Sean T. O'Leary of the AAP.He also said lots of questions remain about who will have access to these vaccines, because \"what we are getting from this [panel] is confusion.\"The group's job is to advise the CDC on U.S. vaccination schedules. As the top health body in the country, doctors look to the CDC on how to advise their own patients, and many insurers make decisions about what vaccines they'll pay for based on CDC recommendations.The committee voted Thursday to recommend against allowing parents to choose a combined MMRV vaccine for children under the age of four. Instead, they recommend the use of a combined measles-mumps-rubella shot and a separate one for varicella (also known as chickenpox).The combined MMRV shot was previously an option for children 12 months of age or older, though the CDC already recommends that separate MMR and varicella vaccines be given under age 4 unless parents express a preference for the combined shot.Measles: Understanding the most contagious preventable disease | About ThatThe panel made their decision based on the risk of febrile seizures (a convulsion caused by a fever), which occasionally occur in kids after they've been given the first dose of the combined vaccine, though it is rare. According to the CDC's own data, these seizures only occur in eight kids per 10,000 who get the combined MMRV shot. There's also a very small risk of febrile seizures with the split MMR and chickenpox vaccines — about 4 in 10,000.These seizures can also occur when children have a fever due to an illness — including from infection with diseases like chickenpox or measles — and also don't usually cause long-term harm.In the wake of the vote, the American Academy of Pediatrics (AAP) said the CDC's meeting promoted \"misguided information\" about childhood vaccines, adding that their organization still views both vaccines as safe.While the CDC is still recommending that people get vaccinated against all four of the infectious diseases, University of Saskatchewan virologist Angela Rasmussen says the decision will require parents to book additional vaccine appointments and have their kids sit through more shots. That added layer of difficulty might mean some kids simply don't get vaccinated against the full slate of illnesses, she said.She says vaccine uptake in the U.S. has already been declining, and that an added layer of difficulty will mean more kids will go unvaccinated and end up getting sick.\"Adding another mechanism … for reducing vaccine uptake is going to have huge consequences in terms of measles epidemics that have happened recently, and in fact are ongoing,\" Rasmussen said.The panel was also expected to vote on delaying the first hepatitis B shot until at least one month of age in infants born to mothers who test negative for the virus. That vote was postponed until Friday morning and then pushed off again indefinitely.The group did, however, vote in favour of testing all pregnant women for hepatitis B. Ahead of the hepatitis B vote, medical experts and patient advocates feared delaying giving the shot would leave infants vulnerable to infection, which can cause liver failure and liver cancer later in life.None of the CDC votes directly affects Canadians or the recommended use of either of those vaccines north of the border.In Canada, the National Advisory Committee on Immunization (NACI) recommends either the combined MMRV vaccine or the MMR shot and separate varicella vaccination at 12 to 15 months of age, and a second dose at 18 months or sometime before the child starts school.But Canada also buys a lot of vaccines from the U.S., according to Dr. Donald Vinh, an infectious disease specialist at the McGill University Health Center. If changes to the CDC's recommendations lead to less demand for the MMRV shot, it could mean less production from U.S. makers — which could affect Canadian supply.\"We're not talking about just the medical decision, but also the logistics,\" Vinh said.Plus, viruses and vaccine misinformation alike can't be contained by borders, Rasmussen says. She points out that due to skepticism about the MMR and MMRV vaccines, rates of vaccination against those diseases have been dropping within Canada already. \"If people begin importing these preventable diseases [when travelling], and the vaccination rates get low enough in Canada, we'll start seeing outbreaks of those pathogens as well,\" Rasmussen explained. \"Where the U.S. goes, many other countries follow.\"Canada and other nations worldwide will be impacted by the loss of good health expertise, as the CDC has historically played a leading role in vaccine research and policy. Lynora Saxinger, an infectious diseases physician, says she used to tune into these ACIP meetings to hear their evidence because the CDC was a guiding health body.But now, \"most people that I know in my field ... would no longer regard decisions coming from the CDC as being robust decisions,\" Saxinger said.Because the CDC has been a source of good information in the past, Saxinger says the risk is twofold: People who don't know about the changes to the CDC's leadership could wind up being misinformed by updated, she says, while vaccine skeptics could point to these decisions as evidence.Under Kennedy's leadership, the committee has undergone a dramatic transformation in recent months.In early June, Kennedy ousted all of the advisory panel's 17 members. He appointed eight new experts to the panel days later, and then added another five this week. While some of them had served on CDC or FDA committees before, many have previously been skeptical of infectious disease spread, vaccines, or both.One of the appointees, Retsef Levi, has previously cast doubt on the safety of mRNA vaccines, saying they can cause serious harm and death, especially among children, according to Reuters.Martin Kulldorff, another of RFK's picks and chair of the committee, was also an architect of the Great Barrington Declaration — a document published in October 2020 that advocated against COVID-19 lockdowns. He co-founded a journal that has raised speculation among scientists and health experts who worry it might become home to dubious information, and was also fired from Harvard University in 2024 when he refused to get vaccinated.On Thursday, Kulldorff defended the credibility of those on the panel and called himself the most \"pro-vaccine scientist in the country.\" He also said his opponents should be willing to test their science in a debate — which he said he'd be willing to have publicly with past CDC directors.\"The members of this … committee are committed to reassuring the public and restoring public confidence [in vaccines] by removing unnecessary risk and harms whenever possible. That is a pro-vaccine agenda,\" he said.\"False accusations that we … are unscientific and dangerous antivaxxers, that just adds legitimacy to anti-vax positions, damaging both public health and the confidence in vaccines.\" ", "relatedStories": [{"url": "https://cbc.ca/news/world/jim-oneill-acting-director-cdc-turmoil-1.7621707", "text": " RFK Jr. deputy Jim O'Neill to serve as acting leader of U.S. CDC"}, {"url": "https://cbc.ca/news/health/florida-vaccines-travel-1.7625612", "text": " Florida is ending vaccine mandates. What do Canadian travellers need to know?"}]}, {"published": "Fri, 19 Sep 2025 14:08:37 EDT", "url": "https://www.cbc.ca/news/entertainment/d4vd-shows-cancelled-suspended-1.7638235?cmp=rss", "headline": "Singer D4vd's shows cancelled amid investigation into body found in car", "author": null, "story": "After the cancellation of a recent Seattle show, singer D4vd has appeared to cancel much of his ongoing tour — with all remaining U.S. tour stops called off, and a number of European shows listing as cancelled on Ticketmaster's website. At the same time, an expanded album set to debut today — Withered: Marcescence, with an announced release date of Sept.19, according to Dv4d's Instagram — has not appeared on streaming services.The news comes shortly after a decomposed body was found inside an impounded Tesla in Los Angeles, identified as teenager Celeste Rivas, who went missing last year.Several local news outlets reported the vehicle was registered to D4vd, whose real name is David Anthony Burke, 20. His representatives did not respond to a request for comment when asked by The Associated Press. Authorities have not implicated D4vd in Rivas's death, and police have not confirmed ownership of the vehicle.Neither D4vd's agents nor the singer's label Interscope immediately responded to a request for comment from CBC. But in the wake of the news, his tour appears to have been largely cancelled. A Wednesday show in Seattle was cancelled earlier this week. According to Variety, shows in Los Angeles and an appearance at the city's Grammy Museum were individually removed from those venue's websites. The only two remaining U.S. stops — L.A. and San Francisco — are listed as cancelled on Ticketmaster.Some tickets for the upcoming Europe leg of his tour remained on sale as of Friday afternoon. But many others were listed as cancelled already — including shows in Oslo, Cologne, Amsterdam, Dublin and Glasgow. Rivas, 15, was found dead inside the vehicle, the Los Angeles County Medical Examiner's Office confirmed Wednesday. Officials have not determined her cause of death.The body was discovered Sept. 8 at a tow lot in Hollywood after someone noticed a stench coming from the Tesla, police said, according to news outlets.In a statement, the medical examiner's office said the body \"was found severely decomposed.\"\"She appears to have been deceased inside the vehicle for an extended period of time before being found,\" officials said.Police confirmed to CBC they had searched a house in the 1300 block of L.A.'s Doheny Place in connection to the death. An unnamed representative for D4vd told NBC Los Angeles that the singer has been co-operating with authorities since the body was found. ", "relatedStories": [{"url": "https://cbc.ca/news/canada/north/keneisha-budoo-munya-mataruse-moses-luwalira-larel-benefit-1.7621360", "text": " Yellowknife concert for family of deceased paddleboarder cancelled"}, {"url": "https://cbc.ca/news/canada/london/motorcyclist-dies-from-injuries-weeks-after-serious-crash-with-sedan-1.7635855", "text": " Motorcyclist dies from injuries weeks after serious crash with sedan"}, {"url": "https://cbc.ca/news/canada/toronto/female-dead-glenlake-high-park-police-1.7626921", "text": " Woman in her 20s dies after being found injured in vehicle near High Park"}, {"url": "https://cbc.ca/news/canada/nova-scotia/missing-man-suspicious-death-cb-1.7622971", "text": " Man's body found inside abandoned car in Cape Breton"}, {"url": "https://cbc.ca/news/canada/edmonton/edmonton-homicide-priscilla-mcgreer-1.7622889", "text": " Edmonton man charged with first-degree murder after woman found shot in SUV"}]}, {"published": "Fri, 19 Sep 2025 11:23:59 EDT", "url": "https://www.cbc.ca/news/world/antifa-trump-kirk-terrorism-1.7637554?cmp=rss", "headline": "What is Antifa and can the U.S. declare it a terrorist group?", "author": {"name": "David Michael Lamb", "url": "https://cbc.ca/news/author/david-michael-lamb-1.7512331"}, "story": "U.S. President Donald Trump says his administration will find out who is funding the Antifa movement, following his comments earlier in the week that he would designate Antifa as a major terrorist organization, calling it a \"sick, dangerous, radical left disaster.\"Antifa, short for anti-fascist, has been in the news for years. Since his first term, Trump has blamed it for poisoning political discourse and causing violence.In the wake of Charlie Kirk's killing, Trump's vice-president, JD Vance (who was also a friend of Kirk's), said the \"incredibly destructive movement of left-wing extremism\" had helped lead to Kirk's assassination.The term refers to a global, loosely knit collection of people who see themselves as protecting society from neo-Nazis, other white supremacists and homophobes. They expose their opponents online, train in self-defence, organize counter-protests and try to stop right-wing messages from spreading.But Antifa is not a formal organization in the way that political parties, companies or interest groups are.Anti-fascist movements have existed as long as fascism has. They first sprung up in Benito Mussolini's fascist Italy in the 1920s and kept growing up to and through the Second World War. But even after Nazism was defeated, anti-fascists didn't go away.The precursor of Antifa is Anti-Racist Action, according to Mark Bray, a professor at New Hampshire's Dartmouth College who wrote Antifa: The Anti-Fascist Handbook. Anti-Racist Action was also a decentralized group opposing right-wing people and ideas that emerged in the 1980s. Antifa grew out of that.In 2020, then-FBI director Christopher Wray said Antifa is a real thing, and added that his agency had investigated \"violent anarchist extremists\" who identify with Antifa.However, Wray also said he was investigating violent acts, not ideas, characterizing Antifa as an ideology, not an organization with a hierarchical structure.Yes, in that there are people who say they are anti-fascist activists who try to stop neo-Nazis and white supremacists from spreading their ideas to others.In 2020, CBC's The Fifth Estate interviewed Antifa activists. Most wanted their identities hidden, in part because they feared being attacked.Confronting Hate: How Antifa is tracking the Extreme RightThey described running online campaigns aimed at getting people fired for belonging to white supremacist organizations. They also spoke about confronting far-right groups at protests.One Antifa activist told The Fifth Estate that silencing her opponents is the goal, and that it's justifiable to use violence to achieve that. \"Physically blocking someone, if that's what it took? Sure. Punching someone in the face or throwing a milkshake on them? Sure.\"They said they are trying to protect society. But now, especially in the U.S., Antifa activists are being accused of threatening the safety and rights of others.Trump's criticism of Antifa dates back to the early part of his first term as president, especially after clashes between Antifa and participants of a white supremacist march in Charlottesville, Va., in 2017.One of the first attempts to formally stop Antifa came in 2019, when U.S. Republican senators Bill Cassidy and Ted Cruz introduced a resolution in the Senate to condemn its violent acts and to designate it a domestic terror organization. It was referred to a committee but went no further. A similar resolution was introduced in the House by Marjorie Taylor Greene in 2023, which was also sent to a committee for study.In 2020, Trump blamed Antifa for violence following the death of George Floyd and repeated his desire to have it designated a terror group.Then the killing of Charlie Kirk earlier this month put the issue back at the top of Trump's agenda. This week in the Oval Office, he blamed the \"radical left\" for \"tremendous violence,\" without offering any evidence. \"The radical left really has caused a lot of problems for this country. I really think they hate our country.\"Yesterday Trump said in a Truth Social post that he would designate Antifa as a \"major terrorist organization.\"The U.S. State Department does have a list of foreign terror organizations. Dozens of groups, including the Islamic State and al-Qaeda, are included on that list. The designation enables the Justice Department to prosecute those who give material support to entities on that list even if that support does not result in violence.But Trump's promise led to some head-scratching, because no domestic equivalent to that list exists. Despite periodic calls to establish a domestic terrorism law, there is no singular statute.It's unclear how the administration would label what is effectively a decentralized movement as a terrorist organization, and the White House did not immediately offer more details.Beyond specific acts of violence, it's also not clear what laws Antifa would be breaking in the U.S. The Supreme Court has ruled many times about speech that threatens violence. In most cases, people can only be prosecuted if they make an imminent threat of violence or lawlessness. Exactly where that line falls is still a matter of debate in legal circles.More broadly, the right to free speech, even hateful speech, is protected in the U.S., sometimes more than people realize.This week, Trump's Attorney General Pam Bondi faced criticism from her own supporters for saying \"hate speech\" could be prosecuted. Some responded with a quote from Supreme Court Justice Samuel Alito, who wrote in a 2017 decision that, \"the proudest boast of our free speech jurisprudence is that we protect the freedom to express 'the thought that we hate.'\"", "relatedStories": [{"url": "https://cbc.ca/news/world/trump-charlie-kirk-prosecute-radical-left-organizations-1.7635781", "text": " Trump vows to dismantle 'radical left' groups in wake of Charlie Kirk killing"}, {"url": "https://cbc.ca/news/world/trump-ban-flag-burning-1.7617620", "text": " Trump signs order banning flag-burning — a right protected by the U.S. Constitution"}, {"url": "https://cbc.ca/news/world/trump-cities-national-guard-constitution-1.7629219", "text": " Is this legal? The facts about Trump's use of National Guard troops"}, {"url": "https://cbc.ca/news/politics/hate-symbols-bill-1.7636559", "text": " Government to table bill Friday criminalizing use of certain symbols to promote hate"}, {"url": "https://cbc.ca/news/world/trump-u-s-military-struck-alleged-drug-smuggling-boat-1.7639196", "text": " Trump says U.S. has launched 3rd fatal strike in a month on alleged drug smuggling boat"}]}, {"published": "Fri, 19 Sep 2025 17:37:28 EDT", "url": "https://www.cbc.ca/news/science/oceans-conservation-treaty-un-1.7638780?cmp=rss", "headline": "Global agreement to protect the oceans set to take effect after 60th ratification", "author": null, "story": "The first treaty to protect marine diversity in international waters will come into force early next year after Morocco became the 60th nation to ratify the agreement on Friday.The High Seas Treaty is the first legal framework aimed at protecting marine biodiversity in international waters — those that lie beyond the jurisdiction of any single country. International waters account for nearly two-thirds of the ocean and nearly half of Earth's surface, and are vulnerable to threats including overfishing, climate change and deep-sea mining.\"The high seas are the world's largest crime scene — they're unmanaged, unenforced and a regulatory legal structure is absolutely necessary,\" said Johan Bergenas, senior vice-president of oceans at the World Wildlife Fund.Still, the pact's strength is uncertain, as some of the world's biggest players — the U.S., China, Russia and Japan — have yet to ratify. The U.S. and China have signed, signalling intent to align with the treaty's objectives without creating legal obligations, while Japan and Russia have been active in preparatory talks.Canada has signed the treaty but not yet ratified it.Ratification triggers a 120-day countdown for the treaty to take effect. But much more work remains to flesh out how it will be implemented, financed and enforced.\"You need bigger boats, more fuel, more training and a different regulatory system,\" Bergenas said. \"The treaty is foundational — now begins the hard work.\"The high seas are home to an array of marine life and are crucial in regulating Earth's climate — they absorb heat and carbon dioxide, and generate half the oxygen we breathe. The treaty is also essential to achieving what's known as the 30x30 target — an international pledge to protect 30 per cent of the planet's land and sea by 2030.The treaty creates a legal process for countries to establish marine protected areas in those waters, including rules for potentially destructive activities like deep-sea mining and geoengineering schemes. It also establishes a framework for technology-sharing, funding mechanisms and scientific collaboration among countries.Crucially, decisions under the treaty will be made multilaterally through what are known as conferences of parties, rather than by individual countries acting alone.Within one year of the treaty taking effect, countries will meet to make decisions about implementation, financing and oversight, and only countries that ratify before then will have voting rights.Some experts warn the treaty's impact could be blunted if the most powerful players on the high seas remain outside it.\"If major fishing nations like China, Russia and Japan don't join, they could undermine the protected areas,\" said Guillermo Crespo, a high seas expert with the International Union for Conservation of Nature (IUCN) Commission.\"It will be interesting to see how the implementation of the treaty will work without those who have historically made the most use of high seas resources.\"The treaty does not create a punitive enforcement body of its own. Instead, it largely relies on individual countries to regulate their own ships and companies.If a ship flying a German flag violates the rules, for example, it's Germany's responsibility to act, said Torsten Thiele, founder of the Global Ocean Trust and an adviser on ocean governance and blue finance.That makes universal ratification essential, he said. \"If somebody hasn't signed up, they'll argue they're not bound.\"Enric Sala, founder of National Geographic's Pristine Seas marine reserve project, warned that some nations may now point to the treaty as a reason to delay or avoid conservation efforts within their own waters.\"There are countries that are using the process to justify inaction at home,\" he said.Lisa Speer, director of the Natural Resources Defence Council's international oceans program, said failing to protect the high seas could mean damage for any individual nation's waters.\"Marine life doesn't respect political boundaries. So fish migrate across the ocean,\" Speer said. \"Same with turtles, with seabirds and a whole host of other marine life.\"And so what happens in the high sea can really affect the health and resilience of the ocean within national jurisdiction, within our coastal waters.\"Ocean exploration pioneer Sylvia Earle welcomed the ratification, but urged leaders not to see it as a finish line.\"This is a way station — not the end point,\" she said.\"If we continue to take from the ocean at the scale we presently are, and use the ocean as a dump site as we presently are, yes we're putting the fish and the whales and the krill in Antarctica and the high seas at risk, but mostly, we are putting ourselves at risk.\"For small island nations like Vanuatu, the treaty marks a major step toward inclusion in decisions that have long been beyond their reach.\"Everything that affects the ocean affects us,\" said Ralph Regenvanu, Vanuatu's minister for climate change.", "relatedStories": [{"url": "https://cbc.ca/news/canada/nova-scotia/cliffs-of-fundy-secures-unesco-geopark-designation-1.7627352", "text": " Cliffs of Fundy secures UNESCO 'green card' for another four years"}, {"url": "https://cbc.ca/news/canada/manitoba/churchill-port-fednav-arctic-shipping-business-1.7615925", "text": " Arctic trade route expansion in northern Manitoba to be discussed following agreement"}, {"url": "https://cbc.ca/news/world/gaza-flotilla-attack-tunisia-1.7629904", "text": " 'We expect this,' says Canadian activist as flotilla bound for Gaza reports 2nd attack"}, {"url": "https://cbc.ca/news/canada/british-columbia/humpback-whale-tangled-fishing-gear-1.7631753", "text": " Humpback whale tangled in fishing gear on B.C.'s coast freed after 3-day rescue"}, {"url": "https://cbc.ca/news/canada/nova-scotia/fishers-memorial-service-marks-100-years-of-honouring-those-lost-at-sea-1.7627521", "text": " Fishers' memorial service marks 100 years of honouring those lost at sea"}]}]
